using System;

//  Проект "Морской бой" в рамках предмета "Технология программирования" 
//  Мышко Е.В.  
//  Шамхалов Р.М. 
//  2017г. 
// 
//  Класс Field представляет собой игровое поле игры "Морской бой". 
//  Данный класс содержит в себе логику игрового поля.  
//  Взаимодействие происходит в основном через координаты.  
//   
//  Класс Field инкапсулирует в себе класс Unit (ячейка игрового поля), 
//  являясь своеобразной "оберткой" для массива объектов Unit. 
// 


public class Field
{
    //Константы класса:
    private const int SIZE_FIELD = 10; //Размер игрового поля (SIZE_FIELD x SIZE_FIELD)

}
